var __reflect = (this && this.__reflect) || function (p, c, t) {
    p.__class__ = c, t ? t.push(c) : t = [c], p.__types__ = p.__types__ ? t.concat(p.__types__) : t;
};
var Util = (function () {
    function Util() {
    }
    return Util;
}());
Util.op1 = [
    { id: 1, str: "美容院" },
    { id: 1, str: "美容中心" },
    { id: 2, str: "水光针" },
    { id: 2, str: "玻尿酸" },
    { id: 3, str: "如何变美" },
    { id: 3, str: "长相不满意" }
];
Util.op2 = [
    { id: 1, str: "美式咖啡" },
    { id: 1, str: "拿铁咖啡" },
    { id: 2, str: "咖啡店" },
    { id: 2, str: "咖啡厅" },
    { id: 3, str: "慢咖啡厅" },
    { id: 3, str: "猫屎咖啡厅" }
];
Util.op3 = [
    { id: 1, str: "游泳池" },
    { id: 1, str: "健身房" },
    { id: 2, str: "肚皮舞" },
    { id: 2, str: "动感单车" },
    { id: 3, str: "有氧运动" },
    { id: 3, str: "无氧运动" }
];
Util.xp1 = [
    { score: 0, str: "哪个是他她它喜欢的“美美 美容院”店标？" },
    { score: 3, str: "<美美 美容院>塑造自然美的你" },
    { score: 1, str: "美美 美容院" },
    { score: 2, str: "整形美容，祝美梦成真" },
    { score: 0, str: "哪一个选项能一言道尽“美美 美容院”最强卖点？" },
    { score: 0, str: "美美 美容院 20年品牌铸锭，国际一流水准，博士后科研团队，认真对待每一位求美者。" },
    { score: 0, str: "爱美人士首选专业隆鼻,隆胸,抽脂,改脸型等美容整形医院，效果宛若天成! " },
    { score: 0, str: "网红最爱美容机构，助您从此走上人生巅峰！" },
];
Util.xp2 = [
    { score: 0, str: "哪个是他她它喜欢的“香榭丽舍的黄昏咖啡店”店标？" },
    { score: 0, str: "<香榭丽舍的黄昏咖啡>浪漫的味道" },
    { score: 0, str: "远离疾病，从一天三杯咖啡开始" },
    { score: 0, str: "极致精选猫屎咖啡，只给有品位的你" },
    { score: 0, str: "哪一个选项能一言道尽“香榭丽舍的黄昏咖啡店”最强卖点？" },
    { score: 0, str: "香榭丽舍的黄昏咖啡店，精选巴西优质咖啡豆，手工现磨，慢煮回味，搭配多款精致糕点，畅饮一杯元气满满，支持外卖，5km内20分钟免费送达！" },
    { score: 0, str: "咖啡的烟碱酸含有维他命B，烘焙后的咖啡豆含量更高，一日三杯咖啡可预防胆结石，香榭丽舍的黄昏咖啡店，您的家庭医生。" },
    { score: 0, str: "全球精选80余种咖啡豆，历经八十八道顶级工序，慢工细火精致熬煮，认真最好每一杯咖啡，只为让你满意！" },
];
Util.xp3 = [
    { score: 0, str: "哪个是他她它喜欢的“最强肌霸健身房”店标？ " },
    { score: 0, str: "<最强肌霸健身房>高颜值一对一健身教练" },
    { score: 0, str: "最强肌霸 你值得拥有" },
    { score: 0, str: "不吃药 不打针30天快速瘦身" },
    { score: 0, str: "哪一个选项能一言道尽“最强肌霸健身房”最强卖点？" },
    { score: 0, str: "最强肌霸健身房，3000平米阳光泳池，近百种操课，全套美国悍马器械，全国冠军一对一专业指导，给您绝对私人订制。" },
    { score: 0, str: "齐全的器械设备，专业的教练进行指导，良好的健身氛围，168元单人游泳+汗蒸体验套餐 仅售99元" },
    { score: 0, str: "人生的道路就像内裤没有一条不是自己选的，那么在健身的路上，你选择开始了吗？" },
];
__reflect(Util.prototype, "Util");
//# sourceMappingURL=Util.js.map